
{
  "status": "success",
  "totalResults": 272,
  "results": [
    {
      "title": "What Tom Cruise was thinking as he did his most death-defying Mission: Impossible stunt yet",
      "link": "https://www.dailymail.co.uk/tvshowbiz/article-12261341/What-Tom-Cruise-thinking-did-death-defying-Mission-Impossible-stunt-yet.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "He celebrated his 61st birthday at the premiere for his newest Mission Impossible movie in Sydney on Monday.",
      "content": "Tom Cruise, 61, opens up about performing death-defying Mission Impossible stunt that saw him fly off a cliff while riding a motorcycle By Ciara O'loughlin For Daily Mail Australia Published: 06:03, 4 July 2023 | Updated: 08:06, 4 July 2023 e-mail 22 shares 5 View comments He celebrated his 61st birthday at the premiere for his newest Mission Impossible movie in Sydney on Monday. But his age hasn't stopped Tom Cruise from continuing to do his own crazy stunts in his action flicks. In his seventh Mission Impossible movie, called Dead Reckoning Part One, Tom performed his most death-defying stunt yet. Paramount Pictures released a 10-minute video about how the wild stunt was possible, which saw the Hollywood actor drive a motorbike off the side of a cliff in Norway. In the jaw-dropping clip, Tom is seen coming off the motorbike and free-falling for several seconds before pulling a parachute. Turning 61 hasn't stopped Tom Cruise (pictured) from continuing to do his own crazy stunts in his action flicks Speaking to 9Honey Celebrity on the red carpet of the movie's Australian premiere, Tom said there was so much going through his mind while filming this scene. 'I was thinking of performance, because, you see me at the beginning, I have to act, but I'm also thinking about the helicopter that's going down, the speed that I have to travel down that ramp,' he said. '[Also] not getting blown off the ramp by a helicopter, not hitting the drone that was at the end of the ramp, not having the motorcycle hit me and destabilise me when I have a few seconds before I hit the ground, holding my position as long as I can, because if I open too soon, that's not the shot.' In his seventh Mission Impossible movie, called Dead Reckoning Part One, Tom performed his most death-defying stunt yet The A-lister said he then worried about opening the parachute, as he prayed that he wouldn't hit the side of the mountain, and would be able to land safely. Before taking on the death-defying stunt, the A-lister did plenty of training. He practiced skydiving for the scene and had a ramp built in England so he could do a few dry runs. Despite the stunt being incredibly dangerous, Tom didn't wear a helmet for his ride off the cliff. He doesn't usually wear helmets for any of his stunts, and on The Sunday Project last weekend, he revealed why. Paramount Pictures released a 10-minute video about how the wild stunt was possible, which saw the Hollywood actor drive a motorbike off the side of a cliff in Norway In the jaw-dropping clip, Tom is seen coming off the motorbike and free-falling for several seconds before pulling a parachute '[It] Just doesn't look cool,' Tom said. 'I wear helmets when I ride motorcycles, and when I'm training, and I wear pads,' he explained. 'But when you start to go film, all the pads come off. So I train in helmets, but when I'm jumping and racing high-speed bikes, then it's not cinematic.' The official trailer for the upcoming Mission: Impossible installment was recently released. The heart-stopping, high-speed clip showed plenty of action scenes with the Hollywood actor, whose film Top Gun: Maverick was a massive summer 2022 hit. He stars alongside Pom Klementieff, Hayley Atwell and fan favourite cast member Simon Pegg. This is Tom's seventh MI film and will be released in Australian theatres on July 8. Returning to the sequel are Tom's usual sidekicks - veteran Hollywood names Ving Rhames, Rebecca Ferguson, and Vanessa Kirby. Tom's seventh MI film and will be released in Australian theatres on July 8 Share or comment on this article: What Tom Cruise was thinking as he did his most death-defying Mission: Impossible stunt yet e-mail 22 shares Add comment",
      "pubDate": "2023-07-04 07:06:00",
      "image_url": "https://global.ariseplay.com/amg/www.arise.tv/uploads/2023/06/Tom-Cruise.jpg",
      "source_id": "dailymailuk",
      "category": [
        "top"
      ],
      "country": [
        "united kingdom"
      ],
      "language": "english"
    },
    {
      "title": "Australian PM ribs Sunak with backing for cricketers after Bairstow stumping row",
      "link": "https://www.watfordobserver.co.uk/news/national/23631233.australian-pm-ribs-sunak-backing-cricketers-bairstow-stumping-row/?ref=rss",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "In a tongue-in-cheek swipe at his UK counterpart, Australian leader Anthony Albanese tweeted: ‘Same old Aussies – always winning!’",
      "content": "Anthony Albanese, in a tongue-in-cheek swipe at his British counterpart Rishi Sunak, said Australia was “right behind” the men’s and the women’s cricket teams, who have both been successful in the opening games of their UK tour. Australia’s leader tweeted: “Same old Aussies – always winning!” It comes after Mr Sunak, who was at Lord’s on Saturday for the second men’s Test, accused the Australian team of breaking the spirit of the game with the dismissal of Bairstow. I’m proud of our men’s and women’s cricket teams, who have both won their opening two matches against England. Same old Aussies – always winning! Australia is right behind , and their teams and look forward to welcoming them home victorious 👏 — Anthony Albanese (@AlboMP) The England batter was stumped in bizarre circumstances on a tense final day on Sunday. Australian wicketkeeper Alex Carey threw down the stumps after Bairstow ducked the final ball of the over and set off to talk to partner Ben Stokes in the apparent belief the over had ended. The Prime Minister’s official spokesman said Mr Sunak, a keen cricket fan, agreed with the views of England captain Stokes about the incident, confirming he “wouldn’t want to win a game in the manner Australia did”. Asked whether Mr Sunak believed Australia’s actions were not in keeping with the spirit of cricket, his spokesman said: “Yes.” But Mr Albanese made clear that Australian captain Pat Cummins and his team had Canberra’s backing. “I’m proud of our men’s and women’s cricket teams, who have both won their opening two Ashes matches against England,” he posted on Twitter. “Australia is right behind Alyssa Healy (and) Pat Cummins and their teams and look forward to welcoming them home victorious.” Anger in the crowd at the manner of Bairstow’s exit spilled over in the usually restrained Long Room at Lord’s, where Australian players Usman Khawaja and David Warner were involved in heated exchanges with jeering members – three of whom were later suspended by Marylebone Cricket Club (MCC). The row is expected to produce a lively atmosphere when the third Test of the men’s series gets under way at Headingley in Leeds on Thursday, as England look to halve the deficit against their rivals. Veterans minister Johnny Mercer said England should not expect “fair play” from Australia as he urged the players on in the next contest. Mr Mercer told Sky News: “It wasn’t actually cheating this time. Previously they did the whole sandpaper thing and when they got caught they were crying all over the media. “I don’t think you’re going to get any particular fair play out of these. “I think you’ve just got to give them a good pasting when you get the chance, and I hope that happens at the next Test match.”",
      "pubDate": "2023-07-04 06:50:50",
      "image_url": "https://www.watfordobserver.co.uk/resources/images/16953298/?type=app&htype=0",
      "source_id": "watfordobserver",
      "category": [
        "top"
      ],
      "country": [
        "united kingdom"
      ],
      "language": "english"
    },
    {
      "title": "What happened when you were sick before the NHS was created 75 years ago",
      "link": "https://www.walesonline.co.uk/news/uk-news/what-happened-you-were-sick-27250330",
      "keywords": [
        "News"
      ],
      "creator": [
        "newsdesk@walesonline.co.uk (Ella Pickover, PA , Steven Smith)"
      ],
      "video_url": null,
      "description": "The NHS was the first system of its kind in the world. As health secretary Aneurin Bevan opened Park Hospital in Manchester in 1948, the future of healthcare in the UK changed forever. ",
      "content": "As health secretary Aneurin Bevan opened Park Hospital in Manchester in 1948, the future of healthcare in the UK changed forever. The new national service meant everybody could get treatment, whether they were a baker or a banker. It was the first system of its kind in the world and people queued in the streets in the hope of getting treatment. Here are your questions answered about the launch of the world's best-known health system. What were the British public told? The 1946 National Health Service Act promised a \"comprehensive health service for England and Wales\". It said the service would bring \"improvements in the physical and mental health of the people\" and the \"prevention, diagnosis and treatment of illness\". Importantly, it said these services would be free of charge. The Act brought together a wide range of medical services under one organisation - including hospitals, doctors, nurses, pharmacists, opticians and dentists. Why did things have to change? Before the creation of the NHS 75 years ago, care for the masses was largely provided by voluntary organisations and charities and insurance schemes, which left millions of people with little or no access to quality healthcare. Subscribe here for the latest news where you live Why 1948? The Act introducing the NHS became law in 1946 - the year after the Second World War ended. During the war, the state had controlled many aspects of people's lives so the concept of the Government looking after the health of the nation may not have seemed completely alien when it was introduced. And in the immediate post-war period, political parties largely agreed on the country's main priorities and generally cooperated trying to achieve them. Post-war recovery was the main priority, but another was the welfare of the people. Aneurin Bevan launched the NHS at Park Hospital, now named Trafford General Hospital, in Manchester on July 5, 1948 (Image: Trafford Healthcare NHS Trust) Who was Aneurin Bevan? When Labour came into power in 1945, an extensive package of welfare measures was introduced, including the NHS. Minster for Health, Aneurin 'Nye' Bevan, was given the task of introducing the service. Many refer to Mr Bevan as the \"chief architect\" of the NHS. He was born in Tredegar , Wales, in 1897 in a poor working class family. His father was a miner and some have said the idea of the NHS came from the collective medical protection scheme set up by miners in his home town. Others have said that the truth is actually more complex. The first baby born on the NHS - Aneira Thomas - was named after Mr Bevan. Was there opposition to the launch of the service? Despite political consensus, the introduction of the service still drew controversy. Many groups, including charities, churches and local authorities did not want the Government to take control of hospitals. Doctors also protested at becoming employees of the state. How was the public informed about the launch of the NHS? Mass marketing was very different 75 years ago and people learned about the launch of the NHS through a variety of unique ways. There were beach carnivals, prayer services in churches, Q&A sessions in local cinemas and cafes. But it was often it was down to ordinary citizens to educate each other about the health service.",
      "pubDate": "2023-07-04 06:02:01",
      "image_url": "https://i2-prod.birminghammail.co.uk/incoming/article27250334.ece/ALTERNATES/s615/0_featureimage.jpg",
      "source_id": "walesonline",
      "category": [
        "top",
        "world",
        "health",
        "politics"
      ],
      "country": [
        "united kingdom"
      ],
      "language": "english"
    },
    
  
    {
      "title": "Reasons for the Delayed Start of Wimbledon 2023 Revealed in Latest UK News",
      "link": "https://insidexpress.com/news/reasons-for-the-delayed-start-of-wimbledon-2023-revealed-in-latest-uk-news/",
      "keywords": [
        "News",
        "Delayed",
        "Latest",
        "Reasons",
        "revealed",
        "start",
        "Wimbledon"
      ],
      "creator": [
        "The Insidexpress"
      ],
      "video_url": null,
      "description": "Novak Djokovic is defending his title (Picture: Zac Goodwin/PA Wire) Wimbledon 2023 is underway, with favourite Novak Djokovic starting his title defence, though rain briefly stopped play. Dark clouds gathered…",
      "content": "Novak Djokovic is defending his title (Picture: Zac Goodwin/PA Wire) Wimbledon 2023 is underway, with favourite Novak Djokovic starting his title defence, though rain briefly stopped play. Dark clouds gathered over London’s SW19 shortly after lunch, as a Wimbledon washout looked on the cards, and a damp Centre Court delayed Djokovic’s match by an hour. Fans of Nick Kyrgios were also left disappointed when the Australian had to withdraw at the last minute due to injury. Plenty of celebrities flocked to the tournament, but the July 3 start date has left many people wondering – hasn’t Wimbledon started later than usual this year? Doesn’t it usually begin in June? Let’s find out. Is Wimbledon starting late this year? The short answer is, yes. Wimbledon 2023 is the joint latest in Open championships history, along with the 2017 event which also began on 3 July. Lauren Silverman and Amanda Holden were on Centre Court on Day One (Picture: Karwai Tang/WireImage Traditionally, Wimbledon began on the last Monday in June. Back in 1983, the Men’s Final was held on July 3 – when John McEnroe took the title – so the Championships had begun a full two weeks earlier. This year the Men’s Final will be held on July 16. Why is Wimbledon late? Back in 2012, the All England Club decided to start the Championships a week later, beginning in 2015. This was to lengthen the grass court season, elongate the gap between Wimbledon and Roland Garros, and allow players more time to recover from the French Open. It also gives players time to adjust from clay to grass courts, as the ball has a lower bounce on grass. However, the Championships didn’t shift into July until 2017, but in 2021 they ran at half capacity in the midst of disruption due to Covid and began on June 28. Last year, the first back at full capacity since the pandemic, Wimbledon began on June 27. In 2024, Wimbledon will run from July 1-14. Are tickets still available? Wimbledon tickets are released every day but to get them, you’ll need to join the famous Queue by 9am at the very latest. The Queue is a Wimbledon tradition for many, just like strawberries and cream (Picture: PA) There are thousands of Ground Passes available for £27 (reduced to £20 from July 11, £15 for July 15 and 15, and £8 for Sunday, 6 July – as there are fewer matches on the outside courts). Plus those who get there early enough could nab one of 500 tickets to the show courts, though you might need to camp overnight to do that. Once inside, there’s a chance to buy show court tickets from the resale kiosk at hugely reduced prices, from 3pm or later, with proceeds going to charity. Follow Metro across our social channels, on Facebook, Twitter and Instagram Share your views in the comments below Publisher",
      "pubDate": "2023-07-04 05:21:56",
      "image_url": "https://d2me2qg8dfiw8u.cloudfront.net/content/uploads/2022/04/21073334/Wimbledon-logo.jpg",
      "source_id": "insidexpress",
      "category": [
        "top"
      ],
      "country": [
        "united kingdom"
      ],
      "language": "english"
    },
    
    
    {
      "title": "Rishi Sunak and Suella Braverman to meet with sporting bodies and police to tackle protests",
      "link": "https://www.dailymail.co.uk/news/article-12260973/Rishi-Sunak-Suella-Braverman-meet-sporting-bodies-police-tackle-protests.html?ns_mchannel=rss&ito=1490&ns_campaign=1490",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Mr Sunak, Ms Braverman and Sports Secretary Lucy Frazer will meet event organiser and national sporting bodies to discuss potential protests at events like Wimbledon or the Grand Prix",
      "content": "Rishi Sunak and Suella Braverman to meet with sporting bodies and police to tackle disruptive protests by groups including Just Stop Oil at Wimbledon and other events this summer Rishi Sunak and Suella Braverman will meet with sporting bodies and the police They hope to tackle disruptive protests which could ruin events over summer By Gemma Parry Published: 01:37, 4 July 2023 | Updated: 02:44, 4 July 2023 e-mail Rishi Sunak and Suella Braverman are set to hold talks with senior sporting figures and police to stop protestors from 'ruining events' over the summer. Mr Sunak, the home secretary and sports minister Lucy Frazer will meet event organisers and national sporting bodies later this week to discuss protests threatened by Just Stop Oil and Animal Rising. It comes amid threats to Wimbledon and the British Grand Prix, as fears grow that further protests will follow those seen at the Ashes last week. Daniel Knorr, a 21-year-old Biochemistry undergraduate at the University of Oxford , was one of three people arrested after he ran on to the world's most famous cricket ground while hurling orange powder into the air. Knorr was charged with aggravated trespass along with co-conspirators Judit Murray, 69, and Jacob Bourne, 26, after the Lord's pitch invasion. They have been bailed and will appear at Westminster Magistrates' Court on July 31. Rishi Sunak and Suella Braverman will meet event organisers and national sporting bodies later this week to discuss the protests Home Secretary Suella Braverman is set to hold talks with senior sporting figures and police England cricket star Jonny Bairstow was hailed 'a hero' for carrying Daniel Knorr off the pitch at Lord's Police officers picked up Daniel Knorr and carried him away after Bairstow intervened Knorr was carried off the Lord's pitch by Jonny Bairstow - a move which Prime Minister Rishi Sunak has supported in a column in The Sun . He said: ' As Bairstow showed at Lord's, people want an end to this disruption.' READ MORE: Drivers try to force their way through Just Stop Oil mob as activists return to streets of west London for rush-hour slow-march protest - after Sadiq Khan said protesters were 'a really important pressure group' <!- - ad: https://mads.dailymail.co.uk/v8/gb/news/none/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement 'And I will work with the police and the sporting authorities to ensure we do stop it.' As the first round got underway this week, Wimbledon was on high alert for similar disruption, with organisers blaming queues on increased security checks . Organisers of the Grand Prix, which starts later this week, are also said to be concerned over potential protests, following a demonstration on the track during the previous racing event last June. In March, the protestors who invaded the track at last year's British Grand Prix were spared jail , despite the 'risk of death' to Formula One drivers and marshals it caused. Louis McKechnie, Emily Brocklebank and Bethany Mogie, who were among five campaigners who were dragged off the circuit at Silverstone as two Formula One cars passed close by, were given suspended jail sentences at Northampton Crown Court on Friday. Passing sentence, Mr Justice Garnham also handed 12-month community orders to fellow protesters David Baldwin, Alasdair Gibson and Joshua Smith. Gibson and McKechnie, both 22; Mogie, 40; Baldwin, 47; Brocklebank, 24; and 30-year-old Smith all claimed the protest, which started after a red flag was signalled to halt the race, had followed a 'meticulous' safety plan. But they were found guilty of causing what the Crown said was 'an immediate risk of serious harm' by sitting 'in the face' of fast-moving vehicles. As the first round got underway this week, Wimbledon was on high alert for similar disruption, with organisers blaming queues on increased security checks Just Stop Oil protesters in London on 29 June - it is feared that the group will host more protests at upcoming sporting events Just Stop Oil activists were also responsible for blocking the Pride in London Parade over the weekend Pictured: Protestors are removed after running onto the track on the opening lap during the F1 British Grand Prix at Silverstone on June 30 last year In recent months, the group has also disrupted the Gallagher Premiership rugby final at Twickenham and the World Snooker Championship. Just Stop Oil activists were also responsible for blocking the Pride in London Parade over the weekend. Members of the group sat in front of a Coca-Cola truck, which was taking part in the parade, in protest of Pride working with industries linked to climate change, and in protest to Coca-Cola. Five people have since been charged under the Public Order Act with behaviour likely to cause harassment, alarm or distress. It is hoped the meeting between the Prime Minister, senior government ministers and sporting bodies and police will deter further protests at sporting events over the coming months. The Home Office declined to set out which policing leaders and sporting groups are attending the meeting this week. Share or comment on this article: Rishi Sunak and Suella Braverman to meet with sporting bodies and police to tackle protests e-mail Sorry we are not currently accepting comments on this article.",
      "pubDate": "2023-07-04 01:44:53",
      "image_url": "https://www.instituteforgovernment.org.uk/sites/default/files/styles/16_9_tablet/public/2022-12/rishi-sunak-downing-street-speech-1504x846px.webp?h=179ab891&itok=zCWFR53o",
      "source_id": "dailymailuk",
      "category": [
        "top"
      ],
      "country": [
        "united kingdom"
      ],
      "language": "english"
    }
  ],
  "nextPage": "1688435093aeb2f6c4ace956ee30f2914233e8063d"
}
